app/controllers/guiders_sessions_controller.rb

 def create
   @guider = Guider.find_by(email: params[:session][:email].downcase)
---
SELECT  "guiders".* FROM "guiders" WHERE "guiders"."email" = ? LIMIT 1  [["email", "123"]]