app/controllers/guiders_controller.rb

INSERT INTO "guiders" ("first_name", "middle_name", "last_name", "password_digest", "email", "age", "contact_number", "alter_number", "city", "state", "zip_code", "passport_number", "driver_license", "SSN", "introduction", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @guider = Guider.new(guider_params)
    if @guider.save

SELECT  "guiders".* FROM "guiders" WHERE "guiders"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "guiders" SET "passport_number" = ?, "driver_license" = ?, "SSN" = ?, "rating" = ?, "introduction" = ?, "comment" = ?, "updated_at" = ? WHERE "guiders"."id" = ?  [["passport_number", "123"], ["driver_license", "123"], ["SSN", "123"], ["rating", 123], ["introduction", "123"], ["comment", "123"], ["updated_at", "2016-03-26 23:20:21.033341"], ["id", 1]]
---
   def update
    @guider = Guider.find_by(id: session[:id])
    if @guider.update(guider_params)

SELECT  "guiders".* FROM "guiders" WHERE "guiders"."id" = ? LIMIT 1  [["id", 23]]
---
  def show
    @guider = Guider.find_by(id: session[:id])