app/controllers/sessions_controller.rb

SELECT  "travelers".* FROM "travelers" WHERE "travelers"."email" = ? LIMIT 1  [["email", "zhangsikai123@tamu.edu"]]
---
  def create
   @traveler = Traveler.find_by(email: params[:session][:email].downcase)