app/controllers/travelers_controller.rb

SELECT  "travelers".* FROM "travelers" WHERE "travelers"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "travelers" SET "gender" = ?, "age" = ?, "street_address" = ?, "city" = ?, "state" = ?, "zip_code" = ?, "country" = ?, "updated_at" = ? WHERE "travelers"."id" = ?  [["gender", ""], ["age", 123], ["street_address", ""], ["city", ""], ["state", ""], ["zip_code", ""], ["country", ""], ["updated_at", "2016-03-26 19:24:20.062734"], ["id", 21]]
---
  def update
    @traveler = Traveler.find_by(id: session[:id])
    if @traveler.update(traveler_params)

INSERT INTO "travelers" ("first_name", "middle_name", "last_name", "password_digest", "email", "gender", "contact_number", "alter_number", "street_address", "city", "state", "zip_code", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @traveler = Traveler.new(traveler_params)
    if @traveler.save

SELECT  "travelers".* FROM "travelers" WHERE "travelers"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @traveler = Traveler.find_by(id: session[:id])