app/controllers/trip_goods_controller.rb

  def create
    @trip_good = TripGood.new(trip_good_params)
    if @trip_good.save
---
INSERT INTO "trip_goods" ("review", "on_shelf", "title", "introduction", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["review", ""], ["on_shelf", "f"], ["title", "s"], ["introduction", "s"], ["created_at", "2016-03-26 23:30:31.879763"], ["updated_at", "2016-03-26 23:30:31.879763"]]